#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aws-route-53.aws_route53_record.shunblog-org-NS will be created
  + resource "aws_route53_record" "shunblog-org-NS" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "shunblog.org"
      + records         = [
          + "ns-1302.awsdns-34.org",
          + "ns-1973.awsdns-54.co.uk",
          + "ns-637.awsdns-15.net",
          + "ns-79.awsdns-09.com",
        ]
      + ttl             = 172800
      + type            = "NS"
      + zone_id         = "ZXHX3MQ2C4KYO"
    }

  # module.aws-route-53.aws_route53_record.shunkakinoki-com-NS will be created
  + resource "aws_route53_record" "shunkakinoki-com-NS" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "shunkakinoki.com"
      + records         = [
          + "ns-1257.awsdns-29.org",
          + "ns-2045.awsdns-63.co.uk",
          + "ns-420.awsdns-52.com",
          + "ns-921.awsdns-51.net",
        ]
      + ttl             = 172800
      + type            = "NS"
      + zone_id         = "Z2Z7MP93Z5M4TE"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
